artillery/load-test.yml
config:
  target: "http://localhost:8080"
  http:
    pool: 25
  phases:
    - duration: 20
      arrivalRate: 1
      rampTo: 5
      name: "Warm up"
    - duration: 300
      arrivalRate: 25
      name: "High load"
scenarios:
  - name: "sample requests"
    flow:
      - post:
          url: "/"
          json:
            clientId: 0000-0000-0000-0000-0000-0001
            events:
              - eventName: TEST_01
                payload:
                  key1: value11
                  key2: value12
                  key3:
                    key31: value131
              - eventName: TEST_02
                payload:
                  key1: value21
                  key2: value22
                  key3:
                    key31: value231
              - eventName: TEST_03
                payload:
                  key1: value31
                  key2: value32
                  key3:
                    key31: value331